class Messages:
    help_msg = """
سلام🤚🏼
لیست دستورات ربات:
`نظارت` :
این دستور در داخل یک پی وی ارسال میشه و اون پی وی رو کنترل میکنه و عکس و فیلم های مخفیانه رو ذخیره میکنه و پیام های پاک شده رو نگه میداره
`لغو نظارت` :
این دستور دستور قبلی رو خاموش میکنه و پی وی رو ربات کنترل نمیکنه
"""

    channel_msg = """
سلام🤖
اطلاعات کاربر تحت نظارت:
نام : {}
ایدی عددی : {}
{}
🤘🏼🤘🏼🤘🏼🤘🏼🤘🏼🤘🏼🤘🏼🤘🏼
"""
    channel_ready = "✍🏼کانال از قبل اماده است ربات فعال شد🦾"
    unsupervised = "کاربر از نظارت خارج شد"
    image_saved = "عکس ذخیره شد🔐"
    video_saved = "ویدیو ذخیره شد🔐"


    find_deleted_message = """
پیام پاک شده پیدا شد:
نام: {}
زمان: {}
متن پیام: {}

"""
    find_update_message = """
پیام ویرایش شده پیدا شد:
نام: {}
زمان: {}
متن پیام: {}

"""
    find_deleted_media = "یک رسانه حذف شده پیدا شد "

    git_url = r"https://github.com/Hossein-YB"
    text_url = f"[👻] {git_url} \n🆔 @hossein_yaghoubii"
